# ElementsConnectedToParent Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..ElementsConnectedToParent Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
You have selected elements that are connected to a parent object in a System. These elements cannot be removed from the System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsConnectedToParent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsConnectedToParent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsConnectedToParent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace